Core/src/src/Documents/СчетФактураПолученныйГрузия/СчетФактураПолученныйГрузия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураПолученныйГрузия</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.АвансовыйОтчет</basedOn>
  <basedOn>Document.ДополнительныеРасходы</basedOn>
  <basedOn>Document.ОтчетПереработчика</basedOn>
  <basedOn>Document.ОтчетКомиссионера</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.РасходСоСчета</basedOn>
  <basedOn>Document.РасходИзКассы</basedOn>
  <registerRecords>AccumulationRegister.АвансыПолученныхФактур</registerRecords>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСФ</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКВозмещениюРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененаПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ДополнительныеРасходы</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыНаПортале</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПлатежа</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.РасходИзКассы</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Documents/СчетФактураПолученныйГрузия/ObjectModule.bsl
// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Или 
		 ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДополнительныеРасходы") Или 
		 ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетПереработчика") Тогда
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Автор = ДанныеЗаполнения.Автор;
		ПериодРегистрации = НачалоМесяца(ДанныеЗаполнения.Дата);
		НоваяСтрока = ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//СуммаДокумента = ДокументыОснования.Итог("СуммаДокумента");
	//СуммаНДС = ДокументыОснования.Итог("СуммаНДС");
	//--------------------------------------------------------------------------
	// © Шишка В.В. [11 августа 2022]  НАЧАЛО
	Если НЕ ДатаИзмененаПользователем Тогда
	
		Если КонецМесяца(ДатаВходящегоДокумента) < КонецМесяца(ТекущаяДатаСеанса())
			И НЕ Дата = КонецМесяца(ДатаВходящегоДокумента)
			Тогда
			
			Дата = КонецМесяца(ДатаВходящегоДокумента);
			УстановитьНовыйНомер();
			
		ИначеЕсли НЕ Дата = КонецМесяца(ДатаВходящегоДокумента) Тогда
			
			Дата = КонецМесяца(ДатаВходящегоДокумента);	
			
		КонецЕсли; 	
	
	КонецЕсли; 
	// © Шишка В.В. [11 августа 2022]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	Если Аванс Тогда
		ДокументыОснования.Очистить();
		СуммаДокумента	= ДокументыПлатежа.Итог("Сумма");
		СуммаНДС 		= ДокументыПлатежа.Итог("СуммаНДС");
	Иначе
		СуммаДокумента	= 0;
		СуммаНДС 		= 0;
		Для Каждого СтрокаТЧ ИЗ ДокументыОснования Цикл
			Если НЕ ТипЗнч(СтрокаТЧ.ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
				СуммаДокумента 		= СуммаДокумента	+ СтрокаТЧ.СуммаДокумента;
				СуммаНДС 			= СуммаНДС 			+ СтрокаТЧ.СуммаНДС;
			Иначе
				//СуммаДокумента 	= СуммаДокумента	- СтрокаТЧ.СуммаДокумента;
				//СуммаНДС 			= СуммаНДС 			- СтрокаТЧ.СуммаНДС;		
				//Lazare_
				СуммаДокумента 		= СуммаДокумента	+ СтрокаТЧ.СуммаДокумента;  //Сумма возврата минусовое число
				СуммаНДС 			= СуммаНДС 			+ СтрокаТЧ.СуммаНДС;        //НДС возврата минусовое число
				//_Lazare			
			КонецЕсли;
			
			//Lazare_
			Если  ТипЗнч(СтрокаТЧ.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная")Тогда 
				СсылкаНаОбъект 		= СтрокаТЧ.ДокументОснование.Ссылка ;
				Если НЕ СсылкаНаОбъект.IDСФ = Формат(Идентификатор,"ЧГ=0") ИЛИ НЕ СсылкаНаОбъект.НомерСФ = НомерВходящегоДокумента Тогда
					ДокОбъект      		= СсылкаНаОбъект.ПолучитьОбъект();
					ДокОбъект.IDСФ      = Формат(Идентификатор,"ЧГ=0") ;
					ДокОбъект.НомерСФ   = НомерВходящегоДокумента ; 
					ДокОбъект.ОбменДанными.Загрузка = Истина;
					ДокОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
			//_Lazare
		КонецЦикла;
		ДокументыПлатежа.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РС_ОбщегоНазначения.СинхронизироватьРеквизитыДокументовОснованийСчетаФактуры(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Аванс Тогда
		//ПроверяемыеРеквизиты.Добавить("ДокументыПлатежа");
		ПроверяемыеРеквизиты.Добавить("ДокументыПлатежа.Документ");
		ПроверяемыеРеквизиты.Добавить("ДокументыПлатежа.Договор");
		ПроверяемыеРеквизиты.Добавить("ДокументыПлатежа.Сумма");
		ПроверяемыеРеквизиты.Добавить("ДокументыПлатежа.СуммаНДС");
	КонецЕсли;
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.СчетФактураПолученныйГрузия.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьАвансыПолученныхФактур(ДополнительныеСвойства, Движения, Отказ);
	Если ЗначениеЗаполнено(ВидНалога) Тогда // Kuzmich, 18.09.2019, Добавление бух проводок в счет фактурах
		УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоНалогам(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры
